## EXPERIMENT 4

In [15]:
import pandas as pd

Program to print first Five Rows.

In [16]:
df = pd.read_csv('train.csv')
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Program to print Index.

In [17]:
df.index

RangeIndex(start=0, stop=891, step=1)

Program to find columns in cvs file.

In [19]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Program to find shape.

In [21]:
df.shape

(891, 12)

Program to find size of csv file.

In [24]:
df.size

10692

Program to find the average value of Survived column and replace missing value by average.

In [26]:
avg_survived=df["Survived"].mean()
print(avg_survived)

df['Survived'] = df['Survived'].replace(to_replace=0,value=avg_survived)

df.head(5)

0.6203448627691052

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.383838,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.000000,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.000000,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.000000,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.383838,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Program to find sum of survived column.

In [29]:
df["Survived"].sum()

np.float64(552.7272727272727)

Program to find mean of survived column.

In [10]:
df["Survived"].mean()

np.float64(0.6203448627691052)

Program to find minimum value of survived column.

In [11]:
df["Survived"].min()

np.float64(0.3838383838383838)

Program to find maximum value of survived column.

In [12]:
df["Survived"].max()

np.float64(1.0)

Program to find the average value of Pclass column and replace missind value by average.

In [13]:
avg_Pclass=df["Pclass"].mean()
print(avg_Pclass)

df['Pclass'] = df['Pclass'].replace(to_replace=0,value=avg_Pclass)

df.head(5)

2.308641975308642

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.383838,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.000000,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.000000,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.000000,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.383838,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Program to find sum of Pclass column.

In [14]:
df["Pclass"].sum()

np.int64(2057)

Program to find mean of Pclass column.

In [15]:
df["Pclass"].mean()

np.float64(2.308641975308642)

Program to find minimum value of Pclass column.

In [16]:
df["Pclass"].min()

np.int64(1)

Program to find maximum value of Pclass column.

In [17]:
df["Pclass"].max()

np.int64(3)

Program to find the average value of Age column and replace missind value by average.

In [18]:
avg_Age=df["Age"].mean()
print(avg_Age)

df['Age'] = df['Age'].replace(to_replace=0,value=avg_Age)

df.head(5)

29.69911764705882

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.383838,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.000000,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.000000,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.000000,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.383838,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Program to find sum of Age column.

In [19]:
df["Age"].sum()

np.float64(21205.17)

Program to find mean of Age column.

In [20]:
df["Age"].mean()

np.float64(29.69911764705882)

Program to find minimum value of Age column.

In [21]:
df["Age"].min()

np.float64(0.42)

Program to find maximum value of Age column.

In [22]:
df["Age"].max()

np.float64(80.0)

Program to find the average value of SibSp column and replace missind value by average.

In [23]:
avg_SibSp=df["SibSp"].mean()
print(avg_SibSp)

df['SibSp'] = df['SibSp'].replace(to_replace=0,value=avg_SibSp)

df.head(5)

0.5230078563411896

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.383838,3,"Braund, Mr. Owen Harris",male,22.0,1.000000,0,A/5 21171,7.2500,NaN,S
1,2,1.000000,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.000000,0,PC 17599,71.2833,C85,C
2,3,1.000000,3,"Heikkinen, Miss. Laina",female,26.0,0.523008,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.000000,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.000000,0,113803,53.1000,C123,S
4,5,0.383838,3,"Allen, Mr. William Henry",male,35.0,0.523008,0,373450,8.0500,NaN,S

Program to find sum of SibSp column.

In [24]:
df["SibSp"].sum()

np.float64(783.9887766554434)

Program to find mean of SibSp column.

In [25]:
df["Age"].mean()

np.float64(29.69911764705882)

Program to find minimum value of SibSp column.

In [26]:
df["Age"].min()

np.float64(0.42)

Program to find maximum value of SibSp column.

In [27]:
df["Age"].max()

np.float64(80.0)

Program to find the average value of Parch column and replace missind value by average.

In [28]:
avg_Parch=df["Parch"].mean()
print(avg_Parch)

df['Parch'] = df['Parch'].replace(to_replace=0,value=avg_Parch)

df.head(5)

0.38159371492704824

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.383838,3,"Braund, Mr. Owen Harris",male,22.0,1.000000,0.381594,A/5 21171,7.2500,NaN,S
1,2,1.000000,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.000000,0.381594,PC 17599,71.2833,C85,C
2,3,1.000000,3,"Heikkinen, Miss. Laina",female,26.0,0.523008,0.381594,STON/O2. 3101282,7.9250,NaN,S
3,4,1.000000,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.000000,0.381594,113803,53.1000,C123,S
4,5,0.383838,3,"Allen, Mr. William Henry",male,35.0,0.523008,0.381594,373450,8.0500,NaN,S

Program to find sum of Parch column.

In [29]:
df["Parch"].sum()

np.float64(598.7205387205386)

Program to find mean of Parch column.

In [30]:
df["Parch"].mean()

np.float64(0.6719646899220411)

Program to find minimum value of Parch column.

In [31]:
df["Parch"].min()

np.float64(0.38159371492704824)

Program to find maximum value of Parch column.

In [32]:
df["Parch"].max()

np.float64(6.0)

Program to find the average value of Fare column and replace missind value by average.

In [33]:
avg_Fare=df["Fare"].mean()
print(avg_Fare)

df['Fare'] = df['Fare'].replace(to_replace=0,value=avg_Fare)

df.head(5)

32.204207968574636

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.383838,3,"Braund, Mr. Owen Harris",male,22.0,1.000000,0.381594,A/5 21171,7.2500,NaN,S
1,2,1.000000,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.000000,0.381594,PC 17599,71.2833,C85,C
2,3,1.000000,3,"Heikkinen, Miss. Laina",female,26.0,0.523008,0.381594,STON/O2. 3101282,7.9250,NaN,S
3,4,1.000000,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.000000,0.381594,113803,53.1000,C123,S
4,5,0.383838,3,"Allen, Mr. William Henry",male,35.0,0.523008,0.381594,373450,8.0500,NaN,S

Program to find sum of Fare column.

In [34]:
df["Fare"].sum()

np.float64(29177.01241952862)

Program to find mean of Fare column.

In [35]:
df["Fare"].mean()

np.float64(32.74636635188397)

Program to find minimum value of Fare column.

In [36]:
df["Fare"].min()

np.float64(4.0125)

Program to find maximum value of Fare column.

In [4]:
df["Fare"].max()

np.float64(512.3292)